{"pageContext":{"allposts":[{"node":{"id":"e2cd30c3-913d-5f6f-9230-f3ed1c91a35c","slug":"automate-with-webhooks","title":"Automate with webhooks","publishDate":"2017-05-12T00:00+02:00","description":{"description":"Webhooks notify you, another person or system when resources have changed by calling a given HTTP endpoint."},"body":{"body":"## What are webhooks?\n\nThe webhooks are used to notify you when content has been changed. Specify a URL, configure your webhook, and we will send an HTTP POST request whenever something happens to your content.\n\n## How do I configure a webhook?\n\nGo to Settings → Webhooks from the navigation bar at the top. From there, hit Add webhook, and you will be directed to your new webhook. Then choose a name, put in the information of your HTTP endpoint (URL and authentication), specify any custom headers and select the types of events that should trigger the webhook.\n\n## Why do I get an old version in the CDA?\n\nAs the delivery API is powered by a CDN network consisting of hundreds of servers distributed across continents, it takes some time (up to a few minutes) to reflect the changes to the published content. This must be taken into consideration when reacting to webhooks. In normal conditions, there could be a reasonable delay of 2 to 5 minutes.\n\nExtracted from the [Webhooks FAQ](https://www.contentful.com/faq/webhooks/ \"Webhooks FAQ\")."},"author":{"title":"Web Developer","phone":"0176 / 1234567","company":"ACME"},"heroImage":{"sizes":{"src":"//images.ctfassets.net/hqbf17jvtgzp/4shwYI3POEGkw0Eg6kcyaQ/fc01337095a22595c4753a3f8d440362/felix-russell-saw-112140.jpg?w=800&q=50","srcWebp":"//images.ctfassets.net/hqbf17jvtgzp/4shwYI3POEGkw0Eg6kcyaQ/fc01337095a22595c4753a3f8d440362/felix-russell-saw-112140.jpg?w=800&q=50&fm=webp"}}}},{"node":{"id":"aa7f37c3-955c-5d5e-9024-0b7e98684e23","slug":"hello-world","title":"Hello world","publishDate":"2017-05-15T00:00+02:00","description":{"description":"Your very first content with Contentful, pulled in JSON format using the Content Delivery API."},"body":{"body":"These is your very first content with Contentful, pulled in JSON format using the [Content Delivery API](https://www.contentful.com/developers/docs/references/content-delivery-api/ \"Content Delivery API\"). Content and presentation are now decoupled, allowing you to focus your efforts in building the perfect app.\n\n## Your first steps\n\nBuilding with Contentful is easy. First take a moment to get [the basics of content modelling](https://www.contentful.com/r/knowledgebase/content-modelling-basics/ \"the basics of content modelling\"), which you can set up in the [Contentful Web app](https://app.contentful.com/ \"Contentful Web app\"). Once you get that, feel free to drop by the [Documentation](https://www.contentful.com/developers/docs/ \"Documentation\") to learn a bit more about how to build your app with Contentful, in particular the [API basics](https://www.contentful.com/developers/docs/concepts/apis/ \"API basics\") and each one of our four APIs, as shown below.\n\n### Content Delivery API\n\nThe [Content Delivery API](https://www.contentful.com/developers/docs/references/content-delivery-api/ \"Content Delivery API\") (CDA), available at `cdn.contentful.com`, is a read-only API for delivering content from Contentful to apps, websites and other media. Content is delivered as JSON data, and images, videos and other media as files.\nThe API is available via a globally distributed content delivery network. The server closest to the user serves all content, both JSON and binary. This minimizes latency, which especially benefits mobile apps. Hosting content in multiple global data centers also greatly improves the availability of content.\n\n### Content Management API\n\nThe [Content Management API](https://www.contentful.com/developers/docs/references/content-management-api/ \"Content Management API\") (CMA), available at `api.contentful.com`, is a read-write API for managing content. Unlike the Content Delivery API, the management API requires you to authenticate as a Contentful user. You could use the CMA for several use cases, such as:\n* Automatic imports from different CMSes like WordPress or Drupal.\n* Integration with other backend systems, such as an e-commerce shop.\n* Building custom editing experiences. We built the [Contentful Web app](https://app.contentful.com/ \"Contentful Web app\") on top of this API.\n\n### Preview API\n\nThe [Content Preview API](https://www.contentful.com/developers/docs/concepts/apis/#content-preview-api \"Content Preview API\"), available at `preview.contentful.com`, is a variant of the CDA for previewing your content before delivering it to your customers. You use the Content Preview API in combination with a \"preview\" deployment of your website (or a \"preview\" build of your mobile app) that allows content managers and authors to view their work in-context, as if it were published, using a \"preview\" access token as though it were delivered by the CDA.\n\n### Images API\n\nThe [Images API](https://www.contentful.com/developers/docs/concepts/apis/#images-api \"Images API\"), available at `images.contentful.com`, allows you to resize and crop images, change their background color and convert them to different formats. Using our API for these transformations lets you upload high-quality assets, deliver exactly what your app needs, and still get all the benefits of our caching CDN."},"author":{"title":"Web Developer","phone":"0176 / 1234567","company":"ACME"},"heroImage":{"sizes":{"src":"//images.ctfassets.net/hqbf17jvtgzp/6Od9v3wzLOysiMum0Wkmme/14710eb5068ea9b3722cb8b669903ef7/cameron-kirby-88711.jpg?w=800&q=50","srcWebp":"//images.ctfassets.net/hqbf17jvtgzp/6Od9v3wzLOysiMum0Wkmme/14710eb5068ea9b3722cb8b669903ef7/cameron-kirby-88711.jpg?w=800&q=50&fm=webp"}}}},{"node":{"id":"977bbcc5-6d12-5964-9d85-b4abf37b57d9","slug":"static-sites-are-great","title":"Static sites are great","publishDate":"2017-05-16T00:00+02:00","description":{"description":"Worry less about security, caching, and talking to the server. Static sites are the new thing."},"body":{"body":"## The case for the static site generator\n\nMore and more developers are jumping on the \"go static train\", and rightfully so. Static pages are fast, lightweight, they scale well. They are more secure, and simple to maintain and they allow you to focus all your time and effort on the user interface. Often times, this dedication really shows.\n\nIt just so happens that static site generators are mostly loved by developers, but not by the average Joe. They do not offer WYSIWYG, previewing on demo sites may take an update cycle, they are often based on markdown text files, and they require some knowledge of modern day repositories.\n\nMoreover, when teams are collaborating, it can get complicated quickly. Has this article already been proof-read or reviewed? Is this input valid? Are user permissions available, e.g. for administering adding and removing team members? Can this article be published at a future date? How can a large repository of content be categorized, organized, and searched? All these requirements have previously been more or less solved within the admin area of your CMS. But of course with all the baggage that made you leave the appserver-app-database-in-one-big-blob stack in the first place.\n\n## Content APIs to the rescue\n\nAn alternative is decoupling the content management aspect from the system. And then replacing the maintenance prone server with a cloud based web service offering. Effectively, instead of your CMS of old, you move to a [Content Management as a Service (CMaaS)](https://www.contentful.com/r/knowledgebase/content-as-a-service/ \"Content Management as a Service (CMaaS)\") world, with a content API to deliver all your content. That way, you get the all the [benefits of content management features](http://www.digett.com/blog/01/16/2014/pairing-static-websites-cms \"benefits of content management features\") while still being able to embrace the static site generator mantra.\n\nIt so happens that Contentful is offering just that kind of content API. A service that\n\n* from the ground up has been designed to be fast, scalable, secure, and offer high uptime, so that you don’t have to worry about maintenance ever again.\n* offers a powerful editor and lots of flexibility in creating templates for your documents that your editors can reuse and combine, so that no developers resources are required in everyday writing and updating tasks.\n* separates content from presentation, so you can reuse your content repository for any device platform your heart desires. That way, you can COPE (\"create once, publish everywhere\").\n* offers webhooks that you can use to rebuild your static site in a fully automated fashion every time your content is modified.\n\nExtracted from the article [CMS-functionality for static site generators](https://www.contentful.com/r/knowledgebase/contentful-api-cms-static-site-generators/ \"CMS-functionality for static site generators\"). Read more about the [static site generators supported by Contentful](https://www.contentful.com/developers/docs/tools/staticsitegenerators/ \"static site generators supported by Contentful\")."},"author":{"title":"Web Developer","phone":"0176 / 1234567","company":"ACME"},"heroImage":{"sizes":{"src":"//images.ctfassets.net/hqbf17jvtgzp/4NzwDSDlGECGIiokKomsyI/dd9d31e22f726ea16b7c60b0dadc2dab/denys-nevozhai-100695.jpg?w=800&q=50","srcWebp":"//images.ctfassets.net/hqbf17jvtgzp/4NzwDSDlGECGIiokKomsyI/dd9d31e22f726ea16b7c60b0dadc2dab/denys-nevozhai-100695.jpg?w=800&q=50&fm=webp"}}}}]}}